{
    "batchcomplete": "",
    "warnings": {
        "main": {
            "*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes. Use [[Special:ApiFeatureUsage]] to see usage of deprecated features by your application."
        },
        "revisions": {
            "*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."
        }
    },
    "query": {
        "pages": {
            "12": {
                "pageid": 12,
                "ns": 0,
                "title": "Anarchism",
                "revisions": [
                    {
                        "contentformat": "text/x-wiki",
                        "contentmodel": "wikitext",
                        "*": "[[Image:Anarchy symbol neat.png|right|100px]]\n'''Anarchism''' is a generic term describing various [[political philosophy|political philosophies]] and [[social movement]]s that advocate the elimination of hierarchy and imposed authority. These philosophies use [[anarchy]] to mean a [[society]] based on [[volunteer|voluntary]] [[cooperation]] of [[freedom (political)|free]] individuals. Philosophical anarchist thought does not advocate [[chaos]] or [[anomie]] &mdash; it intends \"anarchy\" to refer to a manner of human relations that is intentionally established and maintained.\n\nWhile individual freedom and opposition to the state are primary tenets of anarchism, most anarchists insist that anarchism is much more than that. There is also considerable variation among the anarchist political philosophies, to the point that groups with radically different views may consider themselves anarchist.  Opinions vary in areas ranging from the role of [[violence]] in fostering anarchism, to the preferred type of economic system, the relationship between technology and hierarchy, the interpretation of egalitarian ideals, and desirability of various forms of organization.\n\n\n\n==History of anarchism==\n\n===Precursors of anarchism===\n\n[[Anarcho-primitivists]] assert that, for the longest period before recorded [[history]], human society was organized on anarchist principles. There is debate over the [[anthropology|anthropological]] evidence to support this.\n\nSome anarchists have embraced [[Taoism]], which developed in [[History of China|Ancient China]], as a source of anarchistic attitudes [http://www.toxicpop.co.uk/library/taoism.htm]. Similarly, anarchistic tendencies can be traced to the philosophers of [[Ancient Greece]], such as [[Zeno of Citium| Zeno]], the founder of the [[Stoic philosophy]], and [[Aristippus]], who said that the wise should not give up their [[liberty]] to the state [http://www.blackcrayon.com/page.jsp/library/britt1910.html].\nLater movements &ndash; such as [[Stregheria]] in the 1300's, the [[Free Spirit]] in the [[Middle Ages]],\nthe [[Anabaptist]]s, and [[The Diggers]]\n&ndash; have also expounded ideas that have been interpreted as anarchist.\n\nThe first known usage of the word ''anarchy'' appears in the play ''Seven Against Thebes'' by [[Aeschylus]], dated [[467 BC]]. There, [[Antigone]] openly refuses to abide by the rulers' decree to leave her brother Polyneices' body unburied, as punishment for his participation in the attack on [[Thebes (Greece)|Thebes]], saying that \"even if no one else is willing to share in burying him I will bury him alone and risk the peril of burying my own brother. Nor am I ashamed to act in defiant opposition to the rulers of the city (''ekhous apiston tênd anarkhian polei'')\". \n\nAncient Greece also saw the first western instance of anarchism as a philosophical ideal, in the form of the [[stoicism|stoic]] philosopher [[Zeno of Citium]], who was, according to [[Peter Kropotkin|Kropotkin]], \"[t]he best exponent of Anarchist philosophy in ancient Greece\".  As summarized by Kropotkin, Zeno \"repudiated the omnipotence of the state, its intervention and regimentation, and proclaimed the sovereignty of the moral law of the individual\". Within [[Greek philosophy]], Zeno's vision of a free community without government is opposed to the state-[[Utopia]] of [[Plato's Republic]]. Zeno argued that although the necessary instinct of self-preservation leads humans to [[egotism]], nature has supplied a corrective to it by providing man with another instinct &mdash; [[socialization|sociability]]. Like many modern anarchists, he believed that if people follow their instincts, they will have no need of law [[courts]] or [[police]], no [[temple]]s and no public [[worship]], and use no [[money]] (a [[gift economy]] taking the place of the exchanges). Zeno's beliefs have only reached us as fragmentary quotations. [http://www.blackcrayon.com/page.jsp/library/britt1910.html] \n\nIn [[Athens]], the year [[404 BC]] was commonly referred to as \"the year of anarchy\". According to the historian [[Xenophon]], this happened even though Athens was at the time under the rule of the oligarchy of \"The Thirty\", installed by the Spartans following their victory in the second [[Peloponnesian war]], and despite the presence of an [[Archon]], nominated by the oligarchs, in the person of Pythodorus. However, Athenians refused to apply here their custom of calling the year by that archon's name, since he was elected during the oligarchy, and \"preferred to speak of it as the 'year of anarchy'\".\n\nThe Greek [[philosopher]]s [[Plato]] and [[Aristotle]] used the term anarchy negatively, in association with [[democracy]] which they mistrusted as inherently vulnerable and prone to deteriorate into tyranny. Plato believed that the corruption created by democracy loosens the \"natural\" hierarchy between social classes, genders and age groups, to the extent that \"anarchy finds a way into the private houses, and ends by getting among the animals and infecting them\". ('Republic', book 8). Aristotle spoke of it in book 6 of the 'Politics' when discussing revolutions, saying that the upper classes may be motivated to stage a coup by their contempt for the prevailing \"disorder and anarchy (''ataxias kai anarkhias'')\" in the affairs of the state. He also claimed it would give, \"license among slaves (''anarkhia te doulôn'')\" as well as among women and children. \"A constitution of this sort\", he concludes, \"will have a large number of supporters, as disorderly living (''zên ataktôs'') is pleasanter to the masses than sober living\".\n\nThe [[Anabaptist]]s of [[16th century]] Europe are sometimes considered to be religious forerunners of modern anarchism. [[Bertrand Russell]], in his ''[[history of Western philosophy|History of Western Philosophy]]'', writes that the Anabaptists \"repudiated all law, since they held that the good man will be guided at every moment by [[the Holy Spirit]]...[f]rom this premiss they arrive at communism....\" \n\n[[Gerrard Winstanley]], who published a pamphlet calling for communal ownership and social and economic organization in small agrarian communities in the [[17th century]], is considered another of the forerunners of modern anarchism. The first modern author to have published a treatise explicitly advocating the absence of government was [[William Godwin]] in ''[[An Enquiry Concerning Political Justice]]'' ([[1793]]); though he did not use the word ''anarchism'', some today regard him as the \"founder of philosophical anarchism\"[http://plato.stanford.edu/entries/godwin/]. The term \"anarchist\" was used during the [[French Revolution]] as an [[insult]] against [[left-wing politics|the left]], but [[Pierre-Joseph Proudhon]], adopted the term to describe his political philosophy in the [[1840s]].\n\n[[Liberals]] were often labeled \"anarchists\" by [[monarchy|monarchists]], even though they did not call for the abolition of hierarchy. Still, they did promote the idea of human equality, [[individual rights]], and the responsibility of the people to judge their governments, which provided a groundwork for the development of anarchist thought. As [[United States|American]] political society developed along the liberal model, anarchist thoughts were expressed in the writings of [[Henry David Thoreau]] ([[Civil Disobedience]]).  [[Anarcho-capitalism]] arose later as some liberals attempted to reform the ideology of anarchism to make it compatible with capitalism. All other anarchists, however, argue that the hierarchical foundations of capitalism and its many entailments contradict anarchist values.\n\n===Modern anarchism===\n\nIn [[1793]] [[William Godwin]] published ''[[An Enquiry Concerning Political Justice]]'', in which he presents his vision of a free society alongside a critique of government. Some consider this the first anarchist [[treatise]], crediting Godwin with founding modern [[philosophical anarchism]]. He is also considered a forebear of [[utilitarianism]].  It wasn't until [[Pierre-Joseph Proudhon]] published ''[[What is Property?]]'' in [[1840]] that the term \"anarchist\" was adopted as a self-description.  It is for this reason that some claim Proudhon as the founder of modern anarchist theory.\n\nIndividualists, taking much from the writings of [[Max Stirner]], among others, demanded the utmost respect for the [[liberty]] of the individual. \n\nLater in the [[19th century]], [[Anarchist communism|Anarchist communist]] theorists like [[Mikhail Bakunin]] and [[Peter Kropotkin]] built on the [[Marxism|Marxist]] critique of capitalism and synthesized it with their own critique of the state, emphasizing the importance of a communal perspective to maintain individual liberty in a social context, and the critical role of workers self-managed organs of production and creation. \n\nThe [[International Workingmen's Association]], at its founding, was an alliance of socialist groups, including both anarchists and Marxists. Both sides had a common aim (stateless communism) and common political opponents (conservatives and other right-wing elements). But each was critical of the other, and the inherent conflict between the two groups soon embodied itself in an ongoing argument between [[Mikhail Bakunin]], representative of anarchist ideas, and [[Karl Marx]] himself. Generally Marx wanted to work within the system, use hierarchal organizational structures, and run people in elections.  Bakunin hated these ideas, and predicted that if a revolution was won under a Marxist revolutionary party, they would end up being as bad as the [[ruling class]] that they fought against, (a claim that seems to have come true).  In [[1872]], the conflict in the First International climaxed with the expulsion of Bakunin and those who had become known as the \"Bakuninists\" when they were outvoted by the Marx party at the [[Hague Congress (1872)|Hague Congress]]. This is often cited as the origins of the [[Anarchist_objections_to_marxism|conflict between anarchists and Marxists]].\n\n[[Mikhail Bakunin]] saw a need to defend the [[working class]] against oppression and overthrow the ruling class as a means to dissolve the state. [[Peter Kropotkin]]'s [[anarchist communism]] developed from his [[science|scientific]] theory based on [[evolution]] in which co-operation equaled or surpassed competition in importance, as illustrated in ''[[Mutual Aid: A Factor in Evolution]]'' ([[1897]]). \n\nSome [[revolution]]aries of this time encouraged acts of [[political violence]] such as [[bomb]]ings and the [[assassination]]s of [[head of state|heads of state]] to further anarchism.  However, these actions were regarded by many anarchists as counter-productive or ineffective (see \"[[#Violence and non-violence|Violence and non-violence]]\", below). \n\nIn the late 19th century [[anarcho-syndicalism]] developed as the industrialized form of ''libertarian communism'', emphasizing [[industrial action]]s, especially the [[general strike]], as the primary strategy to achieve anarchist revolution, and \"build the new society in the shell of the old\". \n\nAnarchists played a role in many of the [[labour movement]]s, uprisings, and [[revolution]]s of the late [[19th century|19th]] and early [[20th century|20th centuries]], including the [[Russian Revolution]] (1917). In the [[United States]], many new [[immigrant]]s were anarchists; an especially notable group was the large number of [[Jew]]ish immigrants who had left [[Russia]] and [[Eastern Europe]] during the late 19th and early 20th centuries.  These groups were disrupted by the [[Red Scare#The first Red Scare|Red Scare of 1919]].\n\n[[Emma Goldman]] was a very influential anarchist and feminist during this period. She traveled the country and the world spreading anarchist ideas and attempting to live an anarchist life.\n\nThe anarcho-syndicalist orientation of many early American labor unions played a large part in the formation of the American [[political spectrum]].  The United States is the only industrialized former British colony to not have a labor-based political party.  In Mexico, anarcho-syndicalists like [[Richard Flores-Magon]] led various revolts and uprisings, that would help overthrow the dictator Diaz, and lead the way for the growth of anarchism in [[Latin America]], (and also go on to influence the modern day Zapatista rebellion).    \n\nIn [[Europe]], in the first quarter of the 20th century, anarchist movements achieved relative, if short-lived, successes and were violently repressed by states. However, in the 1920s and 1930s the conflict between anarchism and the state was eclipsed by the one among [[liberal democracy]], [[fascism]] and [[communism]], which ended with the defeat of fascism in [[World War II]]. During the [[Spanish Civil War]] (1936-9), a widely popular anarchist movement supported by militias loyal to the republic took control of rural areas of north-east Spain in [[1936]]-[[1937]] and [[collectivization|collectivized]] the land, being crushed in short order by the Communist-controlled republican army.  \n\nAt the end of World War II Europe was mostly divided into a liberal region under United States influence and a communist region under control of the Soviet Union, and the major political dichotomy became that between capitalism and communism. The [[philosophy|philosophical]] influence of anarchism remained latent until it resurfaced in the 1960s.\n\nA surge of popular interest in anarchism occurred during the [[1960s]] and [[1970s]]. In the [[United Kingdom|UK]] this was associated with the [[punk rock]] movement; the band [[Crass]] is celebrated for its anarchist and [[pacifist]] ideas. In [[Denmark]], the [[Freetown Christiania]] was created in downtown [[Copenhagen]]. The housing and employment crisis in most of [[Western Europe]] led to the formation of [[communes]] and squatter movements like the one still thriving in [[Barcelona]], [[Catalunya]].  Militant resistance to neo-Nazi groups in places like Germany, and the uprisings of [[autonomous Marxism]], [[situationist]], and [[Autonomist]] groups in France and Italy also helped to give popularity to anti-authoritarian, non-capitalist ideas.   \n\nBeginning in the later part of the 20th century anarchist [[primitivism|primitivists]] like [[John Zerzan]] began to proclaim that [[civilization]] &mdash; not just the state &mdash; would need to fall for anarchy to be achieved. A rejection of industrial [[technology]] is also prominent in the views of many primitivists, such as [[Theodore Kaczynski]].  This [[primitivist]] worldview was also associated with the growth of the anti-roads movement in the UK, and also the [[Earth First!]] movement in the US.   \n\nThrough the 20th century anarchists were actively involved in the labour, animal-rights, radical ecological, feminist movements, and later in the fight against fascism. The influence of this on anarchist thought is apparent, as most of the traditional anarchist philosophies emphasize the economic implications of anarchism, or arrive at anarchism from economic arguments. Since the mid-1960s, anarchists have been involved in student protest movements, [[peace movements]], squatter movements, and the anti-globalization movement, among others.\n\nThere has long been an association between [[anarchism and the arts]].  Like [[socialism]], [[communism]] and even [[fascism]], anarchism has a plethora of imagery and has developed an [[anarchist symbolism]] which has become associated with a variety of groups and movements, and co-opted (or [[situationist|\"recuperated\"]]) by [[capitalism|capitalist]] industry.  The influence of anarchism is not always directly a matter of specific imagery or public figures, but may be seen in a certain stance towards the liberation of the total human being and the imagination.  In visual art, strains of anarchism have been noted in [[Symbolism (arts)|French Symbolism]], [[Dadaism]], the [[Ashcan School]] of American [[realism]], and the [[mail art]] movement.  [[Surrealism]] in particular was actually equated with anarchism by its founder [[André Breton]].  In music, anarchism has been associated with [[punk rock]], the more explicitly political [[anarcho-punk]], and the [[techno music]] scene.\n\nIn the latter part of the 20th century, and the start of the 21st century, anarchism, (or anti-authoritarianism), has been seen to have the same influence as [[Marxism]] did during the protest movements of the 1960's.  With the uprising of anti-authoritarian movements in the Zapatista communities in Mexico, and the people's uprising starting in 2001 in Argentina, and the global growth and interest in non-statist, anti-capitalist beliefs and organizing have given anarchism a new life within various movements.  Anarchists, (although generally against violence against people except in self-defense), have also been at the forefront of militant resistance against capital and the state, engaging in property destruction against various corporations, militant street battles with police, confronting neo-Nazi and far-right groups, and also having a strong militant presence at anti-globalization protests.\n\n===Anarchism today===\n\nToday, traditional anarchist organizations continue to exist across the [[globe]].\n\n[[Feminism]] arose early in the history of anarchism in the form of [[anarcha-feminism]].  North American anarchism also takes strong influences from the [[American Civil Rights Movement]] and the movement against the [[Vietnam War]]. European anarchism has developed out of the labour movement, and both have incorporated [[animal rights]] and environmental [[activism]] from a [[direct action]] approach which gave growth the the anti-roads movement, and [[Reclaim the Streets]].  Globally, anarchism has also grown in popularity and influence as part of the [[anti-war]], [[anti-capitalism|anti-capitalist]], and [[anti-globalisation]] movements. Recently, anarchists have been known for their involvement in [[protest]]s against [[World Trade Organization]] and [[G8|Group of Eight]] meetings, and the [[World Economic Forum]]; protests which are generally portrayed in mainstream media coverage as violent riots. Many anarchists are part of the ''[[black bloc]]s'', (a tactic in which all people within the bloc wear black and cover their faces to avoid police identification, and to create one large solid mass), at these protests, and engage in protecting various non-violent protesters, setting up barricades, [[vandalism]] and sometimes corporate property destruction, and confronting and defending people from the [[police]]. Many anarchists are critical of the black bloc because some blocs have engaged in property destruction against multi-national corporations and have thus gotten a label as \"violent\", and \"adventurists\" from media and large scale [[liberal]] organizations.   Although black bloc anarchists are often the only visible anarchists at large protests, large scale protests are often constructed and organized through anarchist structures.  Affinity groupings, spokescouncils, and networking all have lead to the success of various large scale anti-war and anti-globalization mobilizations, (such as the protests against the [[WTO Meeting of 1999]] in [[Seattle]], and the Bay Area shut-down during the start of the second Iraq war).  Anarchists have also been involved heavily with underground direct action movements such as the Animal Liberation Front, and the Earth Liberation Front, which are considered \"[[eco-terrorist]]\" by federal authorities and some liberal organizations.    \n\nAnarchism is not constrained to political protest, however. Anarchists also engage in building [[parallel structures]] and organizations, such as [[Food Not Bombs]], radical labor unions, infoshop and radical social centers, new sets of schooling systems, media in various forms, organizing around housing and land issues, and work toward accountability with police and other institutions through such tools as [[consensus]] decision-making.  This is in line with the general anarchist concept of creating \"[[dual-power]]\", which is the idea of creating the structures for a new anti-authoritarian society in the shell of the old, hierarchal one. \n\nSome have said that recent technological developments have made the anarchist cause both easier to advance and more conceivable to people.  Many people use [[cell phone]]s or the Internet to form loose communities which could be said to be organized along anarchist lines. Some of these communities have as their purpose the production of information in a non-commodified or [[use-value]] format, a goal made attainable by the availability of [[personal computing]], [[desktop publishing]] and [[digital media]]. These things have made it possible for individuals to [[file sharing|share music files]] over the Internet, without economic incentive, and even with a certain amount of risk.  There are also [[open source]] programming communities, who donate their time, and offer their product freely as well. Examples include [[Usenet]], the [[free software movement]] (including the [[GNU]]/[[Linux]] community and the [[wiki]] paradigm), and [[Indymedia]]. A book analyzing how this new \"anarchic\" [[mode of production]] is possible is [[Eric S. Raymond]]'s ''The Cathedral and the Bazaar''. Traditional [[historical materialism|historical materialist]] analysis, used by many [[libertarian socialism|libertarian socialists]], is one means of interpreting the above, and would describe it as a \"political economy of non-commodity information production\". There also exists, however, recognition that such technologies, as society currently exists, are dependent on a centralized and hierarchical industrial system, with laborers and non-human life at the bottom.\n\nAnarchists today are active in almost all countries, Greece, Turkey, Australia, America, Canada, Britain, South Africa, Mexico, just to name a few, and engage in a wide range of social activism.\n\n===Historical examples===\n: See [[Past and present anarchist communities]]\n\n==Schools of anarchist thought==\n\nFrom [[William Godwin]]'s utilitarian anarchism to [[Pierre-Joseph Proudhon]]'s [[mutualism]], to [[Max Stirner]]'s [[egoism]], to [[Benjamin Tucker]]'s [[radical individualism]], to [[Peter Kropotkin]]'s [[anarcho-communism|anarchist communism]], the roots of anarchist thought in modern political philosophy are varied, with many different views of what a society without government should be like. [[Anarcho-capitalism]] has roots in [[classical liberalism|classical ''laissez-faire'' liberalism]] but also draws inspiration from the [[individualist anarchist]]s, despite the latter's rejection of capitalist economics. [[Primitivism]], advocating the dissolution of [[civilization]], is reminiscent of, if not inspired by, the early 19th century [[Luddite]] movement.  There are also a number of feminist anarchist theories, including [[anarcha-feminism]], [[eco-feminism]], and [[individualist feminism]]. Another tradition in anarchism follows from individuals like [[Errico Malatesta]] and [[Voltairine de Cleyre]] in claiming no adjective.  These \"anarchists without adjectives\" seek to unify all anarchists around the basic shared principles of being anti-state and anti-capitalism, arguing that the diverse forms of anarchism can work together in relative harmony.\n\nThe schools of thought are listed below in alphabetical order.\n\n===Anarcha-feminism===\nAnarcha-feminism is a kind of [[radical feminism]] that espouses the belief that [[patriarchy]] is a fundamental problem in our society. Feminist anarchism, or anarcha-feminism (a term allegedly created during the 1960s' [[second-wave feminism]]), views [[patriarchy]] as the first manifestation of hierarchy in human history; thus, the first form of oppression occurred in the dominance of male over female.\n\nAnarcha-feminism is most often associated with early 20th-century authors and theorists such as [[Emma Goldman]] and [[Voltairine de Cleyre]], although even early first-wave feminist [[Mary Wollstonecraft]] held proto-anarchist views.  In the [[Spanish Civil War]], an anarcha-feminist group, \"Free Women\", organized to defend both anarchist and feminist ideas.\n\nThough some consider her an anarcho-capitalist, [[Wendy McElroy]] is an example of a contemporary figure claiming to be an [[individualist anarchist]] feminist.\n\n===Anarcho-capitalism===\n\n''Main article:'' [[Anarcho-capitalism]]\n\nAnarcho-capitalism is an ideology which rejects the state and, unlike traditional anarchism, embraces [[capitalism]] (in the sense of a system of trade based on the principle of an economically [[free market]]). Anarcho-capitalists see human freedom in relation to property as paramount, both as a means to a just and prosperous society and as an end in itself, and think capitalism is both the most free and the most efficient method of organizing society. They reject the labelling of capitalism as an unjustified hierarchy. Prominent anarcho-capitalists include [[Murray Rothbard]] and [[David Friedman]].\n\nAll traditional anarchists and most modern anarchists, especially those that are involved with social activism, fervently deny that anarcho-capitalists are anarchists at all, citing the fundamental [[Anarchism and Capitalism|anarchist critiques of capitalism]] that view it as inherently authoritarian and exploitative. They feel that anarcho-capitalism is not part of the \"broad back\" of anarchism, and assert that the nature of bosses and private property is inherently authoritarian and based on the use of force. Whereas traditional anarchists oppose individuals owning private property beyond personal possessions as an artifact of institutional coercion, anarcho-capitalists believe individuals should have the freedom to become [[wealthy]] and to establish enforcement institutions to protect this wealth.  Critics fear that the resulting inequality of wealth could compel others toward [[indentured servitude]] and restrict access to resources necessary for the survival of others.\n\n===Anarcho-communism===\n''Main article:'' [[Anarcho-Communism]]\n\nAnarcho-communism shares many things in common with anarcho-syndicalism but generally strives for a society without any kind of money system, and proposes instead societies based on direct workers control, and [[gift economy|gift economies]].  Anarcho-communists also propose large and small scale connections of communities, groups, and workplaces through [[federation]]s and [[network]]s created by [[free association]] and popular affinity.  Anarcho-communists want direct worker control over production, and have goods divided up between communities based on needs.  Communities would be organized through systems of direct democracy, and through various organizations and collectives to carry out various tasks.    \n\n[[Peter Kropotkin]], [[Emma Goldman]], and most recently, groups like [[NEFAC]] (North Eastern Federation of Anarcho-Communists), have advocated various forms of anarcho-communism.  Historically, anarcho-communism has been said to have been put into practice by millions of people in the anarchist collectives and communes of the anarchist controlled region of the Ukraine during the Russian Revolution, and during the [[Spanish Civil War]] in the [[Aragon]] and [[Catalonia]] regions of Spain.\n\nAnarcho-communists are split generally on the \"Platform\", or the \"Organizational Platform of Libertarian Communists\", written by Russian anarchist militant, [[Nestor Makhno]].  The platform calls for various forms of structures within the anarchist movement, and has been accepted by some anarchists and scorned by others.\n\nAnarcho-communists today are involved in various broad labor and community issues; generally revolving around housing, labor struggles/strikes, anti-racism, and building the anarchist movement.  Anarcho-communists have generally called for more cohesive groups and structures of anarchist groups and thereby garnered criticism from other anarchist sects. Various large scale groups of anarcho-communists exist today with the larger groups existing throughout various countries.\n\n===Anarcho-syndicalism===\n''Main article:'' [[Anarcho-syndicalism]]\n\n[[Image:blkred flag.png|thumb|The red-and-black flag, coming from the experience of anarchists in the labour movement, is particularly associated with anarcho-syndicalism.]]\n\nAnarcho-syndicalism is the anarchist wing of the [[labor union]]  movement.  Its primary aim is the end of the wage system. It functions on principles of workers solidarity, [[direct action]], and self-management.\n\nWorkers' solidarity means that anarcho-syndicalists believe all workers, no matter what their [[race]], [[gender]], or [[ethnic group]] are in a similar situation vis-a-vis their bosses.  Furthermore, it means that, within capitalism, any gains or losses made by some workers in their relation to bosses will eventually impact all workers.  Therefore, it says that in order to gain liberation, all workers must support one another in their [[class war|struggle against bosses]].\n\nAnarcho-syndicalists only believe in direct action &mdash; that is, action directly designed to confront a problem. Direct action can range from traditional [[strike action]] to active [[sabotage]]. \n\nFurthermore, anarcho-syndicalists believe that workers' organizations &mdash; the organizations which struggle against the wage system and which, in anarcho-syndicalist theory, will eventually form the basis of a new society &ndash; should be self-managing.  They should not have bosses or \"business agents\"; rather, the workers should be able to make decisions that affect them amongst themselves.\n\nThe [[International Workers Association]] is an international anarcho-syndicalist federation of various labor unions from different countries.  The [[Industrial Workers of the World]], a once-powerful, still active, and again growing labor union, is considered a leading organ of the anarcho-syndicalist philosophy in the United States.  The Spanish [[Confederación Nacional del Trabajo]]  played a major role in the [[Spanish Civil War]]. Other major anarcho-syndicalist organizations include the [[Workers Solidarity Alliance]], and the [[Solidarity Federation]] in the UK.\n\nSome critics of anarcho-syndicalism contend that its focus on proletarian [[class struggle]] overlooks the needs of segments of society such as parents or others occupied with child-rearing or domestic labor, although some anarcho-syndicalist thought attempts to address other sectors of economic life. Some primitivist authors, notably [[Bob Black]], contend that an anarcho-syndicalist revolution would leave in place social systems they find oppressive ([[work]] and workplaces, for example), although anarcho-syndicalists contend that worker self-management would render those systems fundamentally more humane.\n\n===Ecological anarchism===\n\nThere is a significant [[anarchist]] element to the [[environmental movement]], including those that are known as [[eco-anarchists]] and [[Green anarchism|green-anarchists]]. Eco-anarchism is generally a broad term that broadly refers to anarchists engaged in the earth liberation movement.  The largest segment of 'eco-anarchists' are those involved in the [[Earth First!]] movement, which is a network of various collectives formed along anarchist principles.  Earth First! generally engages in [[direct action]] and eco-defense, such as tree sitting and 'locking down'.  In the modern anarchist movement, eco-anarchists generaly are beleive in [[deep ecology]], which is a world view that embrace biodiversity and sustainability.  Eco-anarchism is also genereally associated with green anarchy, anarcho-primitivism, and anti-civilization anarchy, which expands the eco-anarchist worldview into a critque of modern industrial agro-production.  [[Eco-feminism]] is also sometimes considered a form of anarchism.\n\n===Insurrectionary Anarchism===\n\nInsurrectionary Anarchism generally is critical of larger anarchist organizations like radical unions or federations. It instead is in favor of small affinity groups, carrying out acts of resistance in various struggles. Insurrectionary Anarchists look in part to the actions of such groups as the [[Earth Liberation Front]] as various tactical successes.  Here, [[Wolfi Landstreicher]] writes some of the basis points on it's praxis.  \n\n<blockquote>\nInsurrectionary anarchism is not an ideological solution to all social problems, a commodity on the capitalist market of ideologies and opinions, but an on-going praxis aimed at putting an end to the domination of the state and the continuance of capitalism, which requires analysis and discussion to advance. We don&#8217;t look to some ideal society or offer an image of utopia for public consumption. Throughout history, most anarchists, except those who believed that society would evolve to the point that it would leave the state behind, have been insurrectionary anarchists. Most simply, this means that the state will not merely wither away, thus anarchists must attack, for waiting is defeat; what is needed is open mutiny and the spreading of subversion among the exploited and excluded. Here we spell out some implications that we and some other insurrectionary anarchists draw from this general problem: if the state will not disappear on its own, how then do we end its existence? It is, therefore, primarily a practice, and focuses on the organization of attack...The State of capital will not &#8220;wither away,&#8221; attack is the refusal of mediation, pacification, sacrifice, accommodation, and compromise.\n  [Landstreicher, Wolfi] </blockquote> \n\n[[Alfredo M. Bonanno]], a European insurrectionary anarchist also had a great impact on this specific tendency, writing such works as \"Armed Joy,\" \"The Anarchist Tension,\" and others.  In the US, [[Willful Disobedience]], [[Killing King Abacus]], and other magazines caused interest in insurrectionary politics to grow. Although insurrectionary anarchists are generally interested in class struggle anarchism, in the US, many insurrectionary anarchists consider themselves to be primitivists, or green anarchists, as well.\n\n===Post-left anarchy===\n\nPost-left anarchy (anarchy often used instead of \"anarchism\" to avoid the connotations of doctrine that the ''-ism'' suffix brings) is a more recent current in anarchist thought that seeks to distance itself from the traditional \"left\" - communists, liberals, social democrats, etc. - and to escape the confines of [[ideology]] in general. It has rapidly developed since the fall of the [[Soviet Union]], which many view as the death of authoritarian leftism; however, its roots are clearly visible in the ideas of the 1960s [[Situationists]]. It is not an independent \"movement\" as such but rather a critical way of thinking about anarchist ideas.\n\nPost-leftists argue that anarchism has been weakened by its long attachment to contrary \"leftist\" movements and single issue causes ([[anti-war]], [[anti-nuclear]], etc.). It calls for a synthesis of anarchist thought and a specifically anti-authoritarian revolutionary movement outside of the leftist milieu. It often focuses on the individual rather than speaking in terms of class or other broad generalizations and shuns organizational tendencies in favor of the complete absence of hierarchy. Total individual liberation is a key focus, rather than merely economic liberation.\n\nThe Left, even the revolutionary left, post-leftists argues, is anachronistic and incapable of creating change. It offers critiques of radical strategies and tactics which it considers antiquated; the demonstration, class-oriented struggle, focus on tradition and the inability to escape the confines of history. The book ''Anarchy in the Age of Dinosaurs'', for example, critiques traditional leftist ideas and classical anarchism while calling for a rejuvenated anarchist movement. The widely read crimethInc essay [http://www.crimethinc.com/library/english/yourpoli.html Your Politics Are Boring as Fuck] is another critique of \"leftist\" movements: \"Why has the oppressed proletariat not come to its senses and joined you in your fight for world liberation? ... [Because] they know that your antiquated styles of protest&#8212;your marches, hand held signs, and gatherings&#8212;are now powerless to effect real change because they have become such a predictable part of the status quo. They know that your post-Marxist jargon is off-putting because it really is a language of mere academic dispute, not a weapon capable of undermining systems of control...\"\n\nThe ideas associated with Post-left anarchy have been criticized by other anarchists, notably [[Murray Bookchin]]. Bookchin's polemic, ''Social Anarchism or Lifestyle Anarchism'', attacks these recent trends in anarchist thinking, and advocates a traditional focus on class struggle. [[Bob Black]] wrote a book in response to Bookchin's arguments called ''Anarchy After Leftism'', an important post-leftist work. Anarcho-communists have also criticized post-leftist thinking. Many primitivists, including John Zerzan, can be said to be post-leftists (Zerzan himself has claimed to be &#8220;anti-leftist&#8221;); however, most proponents of Post-left anarchy are not necessarily primitivists. \n\nImportant groups and individuals associated with Post-left anarchy include: [[CrimethInc]], the magazine [[Anarchy: A Journal of Desire Armed]] and its editor [[Jason McQuinn]], [[Bob Black]], and others. For more information, see Infoshop.org's [http://www.infoshop.org/afterleftism.html Anarchy After Leftism] section, and the [http://anarchism.ws/postleft.html Post-left section] on [http://anarchism.ws/ anarchism.ws.]\n\n===[[Primitivism]]===\n''Main article:'' [[Primitivism]]\n\nPrimitivism is a philosophy advocating a return to a pre-industrial and usually pre-agricultural society, and a crtique of industrial civilization, and the alienation that technology, progress, etc, have created between people and the natural world. Primitivism believes that industrial society inevitably produces oppressive structures through specialization of tasks or [[division of labor]], and that [[technology]] has similar negative implications. Most forms of primitivism question [[civilization]] itself.  Primitivism generally sees that by the birth of agriculture, and the birth of cities and the creating of production surplus, gave rise to structures of hierarchy, and later statism.  Anarcho-primitivists point to the anti-authoritarian nature of many 'primitive' or hunter gather socities throughout the world's history, as examples of anarchist socities.  \n\nThe primitivist movement has connections to radical environmentalism movements such as the [[Earth Liberation Front]], the [[Animal Liberation Front]], and [[Earth First!]]. Primitivism has been notably advocated by [[John Zerzan]], and to some extent by [[Theodore Kaczynski]] (the [[Unabomber]]) and [[Derrick Jensen]].\n\n===Technological anarchism===\n\nSome anarchists see [[information technology]] as the way to replace hierarchy, defeat monopoly, and prevent war, and support [[culture jamming]] in particular as a way to do so. Some writers &mdash; particularly [[Iain M. Banks]], who has written quite extensively in the [[science fiction]] genre about [[The Culture]], a futuristic society which has disposed of government &mdash; have theorised that anarchism would be inevitable with the technological advances that would make [[space travel| travelling]] and living in space plausible [http://www.cs.bris.ac.uk/~stefan/culture.html].\n\nIt has also been argued that the [[free software movement]] is an example of anarchist organization, this being an example not of hierarchical business, but of voluntary association for the production of a good.\n\nSee also [[Crypto-anarchism]] and [[Cypherpunk]].\n\n===Utopian Anarchism===\nmain article: [[Utopian anarchism]]\n\nA Utopian anarchist believes, primarily, that nothing is static, everything is relative, and constantly affecting everything else.  However, purpose is important, as is progress of purpose, and progress towards fufillment of purpose.  A utopian anarchist is always thinking of the end desire, and  makes decisions through life keeping this context in mind.\n\nMuch stress is put upon developing education and evolution.  Through free association, a complex web of desires and goals will be strived for, each influencing and perhaps assisting one another in our paths.\n\nThe system strives for perfection, through unified diversity.  Any static system will have flaws, and flaws fester.  If one brushes one's teeth the same way every day, what happens to the missed spot?\n\nThe chaos of a lack of safety through enforced moral judgement scares many away from embracing such a system, though a utopian anarchist would likely say this is an issue with ego and desire for personal power and appreciation.\n\n==Conceptions of an anarchist society==\n\nMany political philosophers justify support of the state as a means of regulating violence, so that the destruction caused by human conflict is minimized and fair relationships are established. Anarchists argue that pursuit of these ends do not justify the establishment of a state, and in fact many argue that the state is incompatible with those goals. Much effort has been dedicated to explaining how anarchist societies would promote these values. While anarchists recognize that the use of violence is ultimately an individual decision, some have proposed mechanisms by which an anarchist society could influence that decision.\n\nAnarchists who have renounced violence in all forms have the simplest answer. Since the state relies on violence to enforce all of its laws, even those that promote its own survival such as taxation, if a large proportion of a society ceases to provide moral or material support to any use of violence, then the state would inevitably collapse, resulting in anarchy. Since this view of anarchy presupposes the renunciation of violence by the bulk of a society, the problem of discouraging the use of violence is not an issue. From this perspective, the main challenge facing anarchists is not to devise institutions, but to convince individuals to renounce the use of violence.\n\nHowever, other anarchists believe that violence is an unfortunate but inevitable part of human existence. These anarchists emphasize that violence is only justified in [[self-defense]], though the definition of self-defense can vary widely. Various institutions have been proposed to ensure that aggressive violence is met with an overwhelming response. These institutions seek to encourage the community to intervene on behalf of the wronged person, or at least not intervene on behalf of the aggressor. For civil disputes, [[jury|juries]] or [[mediation|mediator]]s may be called upon to rule on the dispute. Refusal to submit to the decision of the jury or mediator would reflect poorly on that individual.\n\nLarger conflicts would be addressed with larger organizations. [[Confederation]] is a popular model for such organization. Any such organization would have a \"bottom up\" structure, recognizing the right of individuals and small groups to leave the larger group at any time. In such a situation, it is unlikely that everyone in a country would decide to participate in the same organization. Anarchists hope that this would result in the co-existence of multiple associations with individuals changing their associations as they saw fit.  [[Robert Paul Wolff]] represents those who argue for a [[unanimous consent democracy]].\n\n===Anarchist social organization===\n\nBy rejecting existing political structures, anarchists also reject many of the practices that have been designed with the intent of promoting social cohesion. How anarchists propose that an anarchist society would replace these practices varies widely. Some anarchists believe that the society only needs to be concerned with the use of violence. Others believe that more extensive rules of conduct are necessary, but that these should be enforced by passive punishments, such as economic or social exclusion. Still others take a [[deontology|deontological]] stance on the issue, arguing that the practical tasks of promoting social cohesion are beside the point, and that anarchism is a [[moral imperative]] that should be pursued regardless of consequence.\n\nAnarchists see anarchism more as a mediation, and way for a group, or groups of people to come to a consensus on how to run their society.  In this way, no real hardcore blueprint for an anarchist society can be created, although we can look back on past anarchies, and learn from their examples.  \n\nSchools, social centers, and workplaces are all seen as things that are needed to be turned over and run by the people through systems of direct democracy and self-management.  Social services, (teachers and doctors), would be carried out by interested people, and because in an anarchist society people would be working for themselves and their communities, they would be open to more time to work on bettering themselves and their communities.  Anarchists often point out the success of the postal system, which although is hierarchaly organized with a boss, has no central postal leader, simply various autonomous postal outposts.  Federations and networks of doctors and other workers could follow this method as well, and apply anarchist principles to it's organizational structure.  Indeed, if the modern medical feild was treated like the open software movement, more people would have access to work on cures for diseases, and other problems that threaten society.  In regards to solving issues of crime and settling disputes, anarchists generally are in favor of councils and assemblies of community mediation and discourse.  In a society lacking private property, anarchists assume that social crimes will be the problems to focus on, (i.e. rape, murder, etc).  Anarchists are generally skeptical of the prison system, which they see as simply authoritarian, and not working to fix problems within society, and only manifesting new ones.\n\n===Anarchist economic organization===\n''Main article:'' [[Anarchist economics]]\n\nThe modern state is deeply involved in society's economic activities, ranging from the protection of property, to the regulation of markets, and even the provision of goods.  Most anarchists would agree that radical restructuring of existing economic systems is necessary. For example, [[Bob Black]] proposed that anarchy would allow for \"the abolition of work\"[http://www.zpub.com/notes/black-work.html].\n\nSocialist anarchists advocate the use of [[collective]]s and [[co-operative]]s for organizing small-scale production. These units would be coordinated by voluntary associations that could range from market arrangements to tightly coordinated confederacies. An example of a large-scale communist system is \"The Industrial Commonwealth\" proposed by the [[Industrial Workers of the World]].  Workers, through unions organized by type of product, would democratically govern output.  The model assumes that benefits arise by organizing workers based on the type of good produced (health, agricultural goods, communication, domestic labour). Means and tools of production would be held in common, through the unions.  The Industrial Commonwealth was initially focused on the six sectors of Agriculture, Transport, Construction, Manufacturing, Government Services and Non-Government Services: a model which omitted to recognise particular industries like domestic labour or [[sex work]].  The contemporary model of the Industrial Commonwealth more explicitly recognises this work.\n\nThe new \"Industrial Commonwealth\" economy was to grow within the old capitalist one.  As unions became more powerful, and more workers worked in worker controlled industries, society would be gradually transformed by a constant struggle.\n\nWhile the day-to-day methods of accounting and [[resource allocation]] for the Industrial Commonwealth have never been proposed, the IWW's suggestion that workers learn how to run their factories indicates that workers would largely take over firm management and allocation strategies.\n\n[[Participatory economics]], developed by [[Michael Albert]] and [[Robin Hahnel]], is clearly influenced by anarchist principles. Its advocacy of councils reflects ideas found in the works of Bakunin and the practices of syndicalists. Most anarchists remain critical of Parecon, although it has sparked debate and discussion in all radical circles.\n\n==Major conflicts within anarchist thought==\n\n===Violence and non-violence===\n\nAnarchists have often been portrayed as dangerous and violent, due mainly to a number of high-profile violent acts including [[riot]]s, [[assassination]]s, and [[insurrection]]s involving anarchists.  Since the 1970s, the punk image of irresponsible youths has also been associated with [[anarchist symbolism]], so furthering the association with violence.  \n\nThe use of [[terrorism]] and [[assassination]], however, is condemned by most anarchist ideology, though there remains no [[consensus]] on the legitimacy or utility of violence. \n\nSome anarchists share Leo Tolstoy's [[Christian anarchism|Christian anarchist]] belief in [[nonviolence]]. These [[anarcho-pacifists]] advocate [[nonviolent resistance]] as the only method of achieving a truly anarchist revolution. They often see violence as the basis of government and coercion and argue that, as such, violence is illegitimate, no matter who is the target.  Some of Proudhon's [[France|French]] followers even saw [[strike action]] as coercive and refused to take part in such traditional socialist tactics. \n\nOther anarchists advocate [[Marshall Rosenberg]]'s non-violent communication that relates to peoples fundamental needs and feelings using strategies of requests, observations and empathy yet providing for the use of protective force while rejecting pacifism as a compromising strategy of the left that just perpetuates violence. \n\nOther anarchists, such as [[Mikhail Bakunin]] and [[Errico Malatesta]] saw violence as a necessary and sometimes desirable force. Malatesta took the view that it is \"necessary to destroy with violence, since one cannot do otherwise, the violence which denies [the means of life and for development] to the workers\" (''[[Umanità Nova]]'', number 125, September 6, 1921[http://flag.blackened.net/revolt/anarchists/malatesta/rev_haste.html]).\n\nBetween 1894 and 1901, individual anarchists assassinated numerous heads of state, including:\n*[[President of France|French President]] [[Marie François Sadi Carnot|Sadi Carnot]] ([[1894]]);\n*Empress [[Elisabeth of Austria]] ([[1898]]);\n*King [[Umberto I of Italy]] ([[1900]]); and\n*[[United States President]] [[William McKinley]] ([[1901]]).\n\nSuch \"[[propaganda of the deed]]\" was not popular among anarchists, and many in the movement condemned the tactic. For example, McKinley's assassin, [[Leon Czolgosz]], claimed to be a disciple of [[Emma Goldman]], but she disavowed any association with him. \n\nGoldman included in her definition of anarchism the observation that all governments rest on violence, and this is one of the many reasons they should be opposed. Goldman herself didn't oppose tactics like assassination until she went to Russia, where she witnessed the violence of the Russian state and the [[Red Army]]. From then on she condemned the use of terrorism, especially by the state, and advocated violence only as a means of self-defense.\n\nDepictions in the press and popular fiction (for example, a malevolent bomb-throwing anarchist in [[Joseph Conrad]]'s ''[[The Secret Agent]]'') helped create a lasting public impression that anarchists are violent terrorists. This perception was enhanced by events such as the [[Haymarket Riot]], where anarchists were blamed for throwing a bomb at police who came to break up a public meeting in [[Chicago]]. \n\nMore recently, anarchists have been involved in protests against World Trade Organization (WTO) and International Monetary Fund (IMF) meetings across the globe, which the media has described as violent or riots. Traditionally, [[May Day]] in [[London]] has also been a day of marching, but in recent years the [[Metropolitan Police]] have warned that a \"hardcore of anarchists\" are intent on causing violence.  Anarchists often respond that it is the police who initiate violence at these demonstrations, with the anarchist intent being only to defend themselves.  The anarchists involved in such protests often formed ''[[black bloc]]s'' at these protests and some engaged in property destruction, [[vandalism]], or in violent conflicts with [[police]], though others stuck to [[Nonviolence|non-violent]] principles.\n\nThose participating in black blocs distinguish between \"violence\" and \"property destruction\", they claim that violence is when a person inflicts harm to another person, property destruction or property damage is not violence, they say that you cannot violate a building.\n\n===Pacifism===\nSome anarchists consider [[Pacifism]] (opposition to [[war]]) to be inherent in their philosophy. Some anarchists take it further and follow [[Leo Tolstoy]]'s belief in [[Nonviolence|non-violence]] (note, however, that these [[anarcho-pacifism|anarcho-pacifists]] are not necessarily [[Christian anarchism|Christian anarchists]] as Tolstoy was), advocating [[Nonviolent resistance|non-violent resistance]] as the only method of achieving a truly anarchist [[revolution]].\n\nAnarchist literature often portrays war as an activity in which the state seeks to gain and consolidate power, both domestically and in foreign lands. Many anarchists subscribe to [[Randolph Bourne]]'s view that \"war is the health of the state\"[http://struggle.ws/hist_texts/warhealthstate1918.html]. Anarchists believe that if they were to support a war they would be strengthening the state &mdash; indeed, [[Peter Kropotkin]] was alienated from other anarchists when he expressed support for the British in [[World War I]]. \n\nJust as they are critical and distrustful of most government endeavours, anarchists often view the stated reasons for war with a [[cynicism|cynical]] eye. Since the [[Vietnam War]] protests in [[North America]] and, most recently, the protests against the [[war in Iraq]], much anarchist activity has been [[anti-war]] based.\n\nMany anarchists in the current movement however, reject complete pacifism, (although groups like Earth First!, and [[Food Not Bombs]] are based on principles of non-violence), and instead are in favor of self-defense, and sometimes violence against oppressive and authoritarian forces.  Anarchists are skeptical however of winning a direct armed conflict with the state, and instead concern themselves mostly with organizing.  Most anarchists however, do not consider the destruction of property to be violent, as do most activits who beleive in non-violence.\n\n===Sexual relations===\n\nFor most [[anarchist]]s, [[marriage]] and [[human sexual behavior|sex]] are private matters to be resolved between consenting adults. In their opinion, authorities like governments and clergy have no business meddling with private affairs of individuals who do not voluntarily [[desire]] to follow their commands &mdash; at which point they are no longer authorities and have no power to command those who dissent, only the opportunity to advise those who consent. \n\nOthers, however, believe that the concept of marriage is a fundamentally coercive institution, pointing to the wealth of assumptions about what gender pairings can be acceptable partners, the number of people that can be involved in a relationship, and the proper roles for members of a relationship to have. They argue that marriage is ultimately a [[heteronormativity|heteronormative]] concept, and that it is a particularly subtle form of control.\n\nSome anarchists in [[Spain]] viewed love as a dangerous concept and advocated \"change of commune\" for those experiencing \"the sickness of love.\" This, however, is a small minority view. Many anarchists, including [[Emma Goldman]], believe that love between people is at the core a powerful and benign force, though possibly corrupted by institutions or traditions.\n\n==See also==\n* For a dictionary definition, see [[wiktionary:anarchism]]\n* [[Anarchism and Marxism]]\n* [[Anarchism and capitalism]]\n* [[Anarchist symbolism]]\n* [[Anarcho-capitalism]]\n* [[Anarcho-punk]]\n* [[Punk ideology]]\n* [[Anarcho-syndicalism]]\n* [[Black cat]], for a symbol of anarchism\n* [[Christian anarchism]]\n* [[Equalism]]\n* [[Free-market anarchism]]\n* [[Individualist anarchism]]\n* [[List of anarchists]]\n* [[List of anarchist organizations]]\n* [[List of creative works about anarchism]]\n* [[Past and present anarchist communities]]\n* [[Situationist]]\n* [[Alternative society]]\n* [[Syndicalism]]\n* [[Temporary Autonomous Zone]]\n* [[Free store]]\n* [[Utopian Anarchism]]\n\n===Historical events===\n*[[Paris Commune]] ([[1871]])\n*[[Haymarket Riot]] ([[1886]])\n*[[Kronstadt rebellion]] ([[1921]])\n*[[Spanish Revolution]] ([[1936]]) (see [[Anarchism in Spain]])\n*[[May 1968]], France ([[1968]])\n*[[WTO Meeting of 1999|WTO Meeting in Seattle]] ([[1999]])\n\n===Books===\n'''Classics'''\n*[[Alexander Berkman]], ''[http://dwardmac.pitzer.edu/Anarchist_Archives/bright/berkman/comanarchism/whatis_toc.html What is Anarchism?]''\n*[[Mikhail Bakunin]], ''[http://dwardmac.pitzer.edu/Anarchist_Archives/bakunin/godandstate/godandstate_ch1.html God and the State]'' \n*[[Daniel Guérin]], ''[[Anarchism (book)|Anarchism]]''\n*[[Peter Kropotkin]], ''[[Mutual_Aid:_A_Factor_in_Evolution|Mutual Aid]]'' and ''[[The Conquest of Bread]]''\n*[[Pierre-Joseph Proudhon]], ''[[What is Property?]]''\n*[[Robert Paul Wolff]], ''[[In Defense of Anarchism]]''\n*[[Emma Goldman]], ''[http://dwardmac.pitzer.edu/Anarchist_Archives/goldman/GoldmanCW.html Anarchism and Other Essays]''\n*[[William Godwin]], ''[http://dwardmac.pitzer.edu/Anarchist_Archives/godwin/PJfrontpiece.html An Enquiry Concerning Political Justice]''\n\n===Publications===\n*Journals: ''[[Anarchy: A Journal of Desire Armed]]'', ''[[The Raven (journal)|The Raven]]'', ''[[Fifth Estate]]'', ''[[Green Anarchist]]'', ''[[Our Generation]]'', ''Anarcho-Syndicalist Review'', ''Social Anarchism'', ''Northeastern Anarchist'', ''The Match!'', ''[[Green Anarchy]]'', ''[[Earth First! Journal]]''\n*News publications: ''[[Black Flag (newspaper)|Black Flag]] (Organ Of The [[Anarchist Black Cross]])'', ''[[Class War]]'', ''[[Industrial Worker]]'', ''[[Freedom newspaper|Freedom]]'', ''[http://inform.motkraft.net/ INFOrm]''\n*Other magazines and zines: Anarchist Panther, Harbinger (CrimethInc), Practical Anarchy, [[Species Traitor]], [[Profane Existence]], Alternative Press Review, Communicating Vessels, Killing King Abacus, Willful Disobedience, Do or Die, In Ya Face, Anarchy and Community, Anchorage Anarchy, Black Badger, Slingshot.\n*Collections: [http://www.spunk.org/ Spunk Library]\n*Related publications: ''[[Z Magazine]]'', ''[[AdBusters]]''\n\n===Concepts===\n*[[Anti-Capitalism]]\n*[[Anti-Authoritarianism]]\n*[[Direct action]]\n*[[Direct democracy]]\n*[[Dual Power]]\n*[[Gift economy]]\n*[[Intellectual worker]]\n*[[Media democracy]]\n*[[Mutual aid]]\n*[[General Strike]]\n*[[Monopoly on violence]]\n*[[Sovereignty of the individual]]\n*[[Union of egos]]\n*[[Voluntary association]]\n*[[Anarchist economics]]\n*[[Self-Management]]\n*[[Deep Ecology]]\n*[[Radical Feminism]]\n*[[Parecon]]\n*[[Free Association]]\n*[[Consensus Democracy]]\n\n===Anarchist organizations===\n*[[AK Press]]\n*[http://www.infoshop.org/amp.html Alternative Media Project]\n*[[Anarchist Black Cross]]\n*[[Anarchist Communitarian Network]]\n*[[Anarchist Federation]]\n*[[Anarchist Football Network]]\n*[[Anarchist People of Color]]\n*[http://www.anarchism.org.nz Anarchy Aotearoa / New Zealand]\n*[http://www.anarkhia.org Anarkhia, Anarchist Collective from Montreal]\n*[[Animal Liberation Front]]\n*[[Biotic Baking Brigade]]\n*[[CrimethInc.]]\n*[[Critical Mass]]\n*[[Earth Liberation Front]]\n*[[Food Not Bombs]]\n*[[FRAC]]\n*[[Freedom Press]]\n*[[Green Anarchy]]\n*[[Homes Not Jails]]\n*[[Industrial Workers of the World]]\n*[[Indymedia]]\n*[[Institute for Anarchist Studies]]\n*[[IWA-AIT]]\n*[http://www.jura.org.au Jura Books]\n*[[Midwest Unrest]]\n*[[NEFAC]]\n*[[Peoples' Global Action]]\n*[[Red and Anarchist Action Network]]\n*[[Red and Anarchist Skinheads]]\n*[[Workers Solidarity Movement]]\n*[[Zabalaza Anarchist Communist Federation]]\n\nWhile all of these [[organizations]] have anarchists as members, many are inclusive beyond anarchist and include [[anti-authoritarianism|anti-authoritarians]] and [[greens]].\n\n===Anarchism by region/culture===\n* [[African Anarchism]]\n* [[Anarchism in Phoenix]]\n* [[Anarchism in Spain]]\n* [[Anarchism in the English tradition]]\n\n==External links==\n*An [http://www.infoshop.org/faq/index.html Anarchist FAQ] written from the perspective of the Anarchist movement.\n*[http://www.gmu.edu/departments/economics/bcaplan/anarfaq.htm Anarchist Theory FAQ] written from the perspective of libertarian capitalists.\n*[http://www.infoshop.org/fake.html Fake Anarchists and Libertarians]\n*Hundreds of anarchists are listed, with short bios, links & dedicated pages [http://recollectionbooks.com/bleed/gallery/galleryindex.htm at the Daily Bleed's Anarchist Encyclopedia]\n*[http://www.zabalaza.net/texts/african_anarchism/contents.htm African Anarchism: The History of a Movement]\n*[http://anarchoblogs.protest.net/ Anarchoblogs]\n*[http://www.anarchopedia.org/ Anarchopedia] intends to be an anarchist encyclopedia using the [[MediaWiki]] engine.\n*[http://dwardmac.pitzer.edu/Anarchist_Archives/ Anarchy Archives] extensively archives information relating to famous anarchists.  This includes many of their books and other publications.\n*[http://www.antflip.com/anarchy.htm Antflip.com | Anarchism Page] A selection of websites, books, and online articles that explore social anarchism.\n*[http://www.infoshop.org Infoshop.org]\n*[http://www.iwa-ait.org/ International Workers Association (IWA-AIT)]\n*[http://www.takver.com/history/melb/maa01.htm Melbourne Anarchist Archives 1966-1973]\n*[http://www.infoshop.org/inews/stories.php?story=03/09/06/9662148 The Inefficient Utopia] - an analysis of anarchist use of consensus, by the [[Curious George Brigade]].\n*[http://www.nefac.net North Eastern Federation of Anarcho-Communists] - ([[NEFAC]])\n*[http://www.greenanarchy.org Green Anarchy]\n*[http://www.blackandgreen.org Network of Green Anarchist Collectives]\n*[http://www.autonome.org Autonome]\n*[http://www.iww.org Industrial Workers of the World]\n*[http://www.retailworkers.org IWW Retail Workers]\n*[http://www.crimethinc.com  Crimethinc.com]\n*[http://www.crimethinc.net  Crimethinc.net]\n*[http://www.earthliberationfront.org  Earth Liberation Front] (ELF)\n*[http://www.animalliberationfront.net Animal Liberation Front] (ALF) \n*[http://www.illegalvoices.org/apoc Anarchist People of Color]\n*[http://www.anarcha.org Anarcha-feminism]\n*[http://www.earthfirstjournal.org  Earth First!]\n*[http://www.aranet.org/pn Anti-Racist Action]\n*[http://www.zmag.org/grubanar.htm Towards an another anarchism] by Andrej Grubacic at the [[World Social Forum]]\n\n{{Anarchism}}\n\n[[Category:Anarchism|*]]\n[[Category:Forms of government]]\n[[Category:Political theories]]\n[[Category:Social philosophy]]\n\n[[bg:&#1040;&#1085;&#1072;&#1088;&#1093;&#1080;&#1079;&#1098;&#1084;]]\n[[ca:Anarquisme]]\n[[de:Anarchismus]]\n[[eo:Anarkiismo]]\n[[es:Anarquismo]]\n[[et:Anarhism]]\n[[eu:Anarkismo]]\n[[fa:&#1583;&#1608;&#1604;&#1578;&#8204;&#1586;&#1583;&#1575;&#1574;&#1740;]]\n[[fi:Anarkismi]]\n[[fr:Anarchisme]]\n[[gl:Anarquismo]]\n[[he:&#1488;&#1504;&#1512;&#1499;&#1497;&#1494;&#1501;]]\n[[it:Anarchismo]]\n[[ja:&#12450;&#12490;&#12461;&#12474;&#12512;]]\n[[nl:Anarchisme]]\n[[no:Anarkisme]]\n[[pl:Anarchizm]]\n[[pt:Anarquismo]]\n[[ru:&#1040;&#1085;&#1072;&#1088;&#1093;&#1080;&#1079;&#1084;]]\n[[simple:Anarchist]]\n[[sv:Anarkism]]\n[[tokipona:nasin pi lawa ala]]\n[[zh-min-nan:Hui-th&#243;ng-t&#299;-ch&#250;-g&#299;]]"
                    }
                ]
            }
        }
    }
}